{"id": "9d887740d65d63090084d1b7bdca03fbc6089fcf", "title": "August 2016 - Page 5 of 7 - 1redDrop", "content": "1redDrop Technology News from the World's Most Influential Companies August 2016 The Fastest Tesla in the World, Faster Than Gravity at 0-60 mph in 2.6 secs Tesla is outperforming itself over and over again. First there was the Roadster, a mouth-watering piece of engineering. Then there… BMW Gearing Up for the EV Battle of the Century BMW cuts a lonely figure in the list of top-selling electric car models in 2015. Tesla has indeed runway with… Can Artificial Intelligence (AI) Really Do These Things? Artificial intelligence (AI) is slowly making a shift from the research and development stage to touching our lives wherever we… 4 iPhone 7 Tips for Longer Battery Life, Also Works for iPhone 6 Series Everyone is excited about the September 7 launch of the brand new iPhone 7 and iPhone 7 Plus from Apple…. Upgrade to iPhone 7 or Keep the iPhone 6S Plus? iPhone 7 reviews during the pre-launch of the latest creation from Apple all show that the new iPhone 7 smartphone… Amazon’s Delivery Drone Design Unveiled! After much speculation on the design and look of Amazon’s futuristic delivery drones, we’ve finally been given a glimpse into… Microsoft Holographic for Windows 10 PCs by 2017 Microsoft seems to be pushing hard on the virtual reality (VR) and augmented reality (AR) front. First, they recently launched… Are These Six iPhone 7 Rumors True? Over the past several days, we’ve been reporting whatever we could find on the new iPhone 7 and iPhone 7… Google Duo – The Apple Facetime Killer Cometh In an attempt to recreate the magic of Facetime on Android, Google has just released a product called Duo, a… Tesla Model S Catches Fire in France During Test Drive Over the weekend, a reddit post and subsequent report told of a major accident involving a Tesla Model S that was being taken… Apple CEO Tim Cook on the iPhone’s Future and Artificial Intelligence Initiatives In a recent interview with the Washington Post, Apple’s CEO Tim Cook spoke candidly about his company’s progress in artificial… Nvidia Donates $129k Supercomputer to Elon Musk’s Open Artificial Intelligence Project In an extremely generous gesture, gaming chipmaker Nvidia donated a supercomputer to Tesla CEO Elon Musk’s pet project, OpenAI. The… BMW Finally Announces Self-driving Car, Pressure from Apple, Google, Tesla and Mercedes According to Maximilian Doemling, who is BMW’s senior manager for “highly automated driving”, the German carmaker will be launching its own fleet of… Microsoft Hololens Commercial Suite “Ready for Business”. What About Consumers? In the race for virtual reality (VR), Microsoft has just taken a giant leap forward by announcing a commercial version… Apple TV and Twitter Join Hands for NFL Live Streaming New York Times writer Mike Isaac has just reported that Twitter has signed an agreement to feature on Apple TV….", "timestamp": 1766186234343, "lang": "en-US", "length": 2836, "meta": {"description": null, "keywords": null, "published_at": null, "canonical": null}}