{"id": "a50e9ea1090d89faa4e60d48eb6f934c2154f929", "title": "iPhone 7 with No 3.5mm Audio Jack? Apple CoFounder Steve \"Woz\" Wozniak Warns CEO Tim Cook of Repercussions - 1redDrop", "content": "1redDrop Technology News from the World's Most Influential Companies iPhone 7 with No 3.5mm Audio Jack? Apple CoFounder Steve “Woz” Wozniak Warns CEO Tim Cook of Repercussions In several of our recent articles we were able to publish confirmed and unconfirmed rumors about the new iPhone 7 and iPhone 7 Plus. Here they are for your reference: Are These Six iPhone 7 Rumors True? Upgrade to iPhone 7 or Keep the iPhone 6S Plus? One of the rumors that we think is confirmed was that the standard 3.5mm audio jack on older iPhones may finally disappear with the iPhone 7 and iPhone 7 Plus. In our articles, we pointed out the fact that this could be an annoyance to buyers who would then be forced to purchase an additional accessory – a lightning dongle – to be able to use their existing headphones. More recently, co-founder of Apple Inc. Steve “Woz” Wozniak is reported to have warned Apple CEO Tim Cook that “that’s going to tick off a lot of people.” Wozniak is a renowned expert on audio capability because he’s an audiophile himself. His chief concern seems to be that the Bluetooth pairing may not deliver the kind of audio quality that the humble 3.5 mm jack can. Digitally transmitted audio is still in a very nascent stage, and the bandwidth for Bluetooth is still inadequate for delivering high-quality audio. That’s Steve Wozniak’s opinion as well: “I would not use Bluetooth … I don’t like wireless. I have cars where you can plug in the music, or go through Bluetooth, and Bluetooth just sounds so flat for the same music.” Of course, Bluetooth is not the only option. We mentioned earlier that the lightning dongle could achieve the same objective, but will incur an additional cost. If you’re willing to pay for it, then you probably won’t mind the 3.5 mm jack missing from the iPhone 7. However, the majority of users still prefer analog audio because digital “just isn’t up to par”, as Wozniak puts it. It’s a question of user preference, so Apple could be in trouble if a large number of users decide to ditch the iPhone 7 and stick with their iPhone 6 or its variants. The truth of the matter is that iPhone 7 is going to sell with or without the audio jack. The only question is, how much will their sales get hit if they have indeed decided to do away with the jack altogether? On the other hand, Woz does support Apple’s futuristic thinking on the matter: “If there’s a Bluetooth 2 that has higher bandwidth and better quality, that sounds like real music, I would use it. But we’ll see. Apple is good at moving towards the future, and I like to follow that.” Come September we’ll know what the reality of the situation is. iPhone 7 should hit stores around a month from now, although the launch may happen two weeks ahead of that in Apple’s typically grandiose fashion, on September 7. This could be a make or break deal for Apple and the new iPhone 7. If you’re reading this on Apple News, please favorite the 1RedDrop channel (next to our logo) to add us to your news feed, or Like our page on Facebook. Please bookmark our site for more insightful articles on current and future technologies that are changing our lives. Post navigation Related News Apple’s Lightning Era Nears Its End: What the USB-C Mandate Means for the Future iOS 18.2: A Revolutionary Update with Game-Changing Features Apple Launches Mac Mini with M4 Chip: A New Era of Power and Sustainability", "timestamp": 1766204107542, "lang": "en-US", "length": 3393, "meta": {"description": "In several of our recent articles we were able to publish confirmed and unconfirmed rumors about the new iPhone 7 and iPhone 7 Plus. Here they are for your reference: Are These Six iPhone 7 Rumors True? Upgrade to iPhone 7 or Keep the iPhone 6S Plus? One of the rumors that we think is confirmed...", "keywords": null, "published_at": 1472116670000, "canonical": "https://1reddrop.com/2016/08/25/iphone-7-no-3-5mm-jack-apple-cofounder-woz-warns-ceo-tim-cook-repercussions/"}}