{"id": "daa5b44173babed9abc3c59302aedc7fbe0ce8a5", "title": "Upgrade to iOS 10: 10 Best Hidden Features on iOS 10, Soon on iPhone 7 - 1redDrop", "content": "1redDrop Technology News from the World's Most Influential Companies Upgrade to iOS 10: 10 Best Hidden Features on iOS 10, Soon on iPhone 7 Yesterday, we shared some of the top new features on the brand new iOS 10 Public Beta version 6 from Apple. The latest version of Apple’s mobile operating system family has some very cool features, but some of the best ones are the ones that Apple didn’t even mention at the WorldWide Developer Conference 2016. Here are 10 of the best hidden features on iOS 10. I’ve saved the best for last but try not to scroll past the other cool ones! 🙂 Clear All Notifications with One Tap This is something we’ve all been wishing for when closing notification after notification. Our wish has finally been granted. All you need to do is 3D Touch the X icon found on the top right of the notifications panel and you’ll get a new popup that says Clear All Notifications. Tap it once and watch your notifications disappear. You’ve probably already seen this on the Apple Watch, and now it’s going to be on the iPhone 7 as well as upgraded iPhone 6. Two Safari Tabs on iPads You can now have two Safari tabs visible at the same time on your new iPad with iOS 10. The Split View feature release on an earlier iOS version didn’t work with Safari tabs, but Apple has finally done that. Simply long-press the tab you want to split from and drag it to one side. The other tab will be visible right below that, and you can toggle between tabs by just tapping on them. Turn Off Raise to Wake The Raise to Wake feature on iOS 10 is one of the coolest yet, but if you don’t want the iPhone 7 you want to buy to light up with joy every time you pick it up, just go to Settings and turn it off. This will also work on older devices that have been upgraded to iOS 10. Quick News View If you just want a gist of today’s news but don’t really want to open the News app to scroll through the day’s news, just 3D Touch the News app icon and it will show you a preview of what’s inside. This is a great feature because it also works with some other apps like your Activities app. Just 3D Touch the icon for a quick view of what the day has in store for you. Camera Shortcut is Different From iOS 7 upwards, you had to swipe up to turn on the camera. On iOS 10 you have to swipe left from the lock screen. We’re not sure why that is, but could it be that a lot of people complained that they ended up accidentally pressing the home button while attempting to swipe up? Not really sure where Apple is going with this. Change Torch Brightness You can alter the intensity of the built-in torch app. In the Control Center, 3D Touch the torch icon and it will show you three brightness options. This is useful when you need a little bit of extra light but don’t want to drain your battery too quickly. Battery Life Enhancement Suggestions Though the iPhone 7 promises to come with a bigger battery that has a longer life on a single charge, most of the iPhone users I know tend to carry their chargers with them. Some apps can drain a lot of power, but iOS 10 comes with a feature that will clue you in on which apps you can shut down to extend battery power. The suggestions will depend on what you’ve been using in the last few hours, so your phone might suggest that you turn off WiFi or Cellular Data, or maybe even change the screen brightness or use auto-brightness. Apple Pay in Safari Ever since Apple Pay took to the web , iOS users have been able to make payments on their Mac as well using Apple Pay. On mobile devices such as iPad and iPhone, you can now either use the Apple Pay app itself or access your Apple Pay account directly from the Safari browser. With this feature, Apple is trying to popularize web and mobile payments and make it convenient for you to switch over from using PayPal or other applications. Messaging with Digital Touch This is not a feature that many people will use, but with certain users it’s going to be a massive hit. Using Digital Touch, which is also available on the Apple Watch and upcoming Apple Watch 2, you can send sketched messages, your heartbeat or even a kiss on any photos or videos that you send. What’s more, there’s an option to let the other person know you’ve seen their message without actually replying. Just press and hold the message and you’ll get options to “tapback” a quick icon like a Haha or a thumbs up. Messaging seems to have been given a lot of upgrades on iOS 10, so I’ll cover that in a separate article tomorrow. Remove Built-in iOS Apps Possibly the best new feature is the ability to remove stock apps from your iPhone. This brand new feature is a blessing for people who’ve been wondering what to do with all those apps that you never use by came with your iPhone 5 or iPhone 6 or any of its cousins – calendar, calculator, maps and so on. These stock apps are installed by Apple, but a lot of people have their own favorites like Gmail or even Google Duo for video calls, which is said to be faster and smoother than Apple’s Facetime. I’ve written about this in Google Duo – The Facetime Killer Cometh . Removing stock apps does come with some disclaimers because all related data will be wiped out. However, if you delete an app that shares resources with another, that won’t happen. For example, if you delete Contacts, you’ll still have your contacts list in the Phone app. But be careful with this one because you may not be able to retrieve your data later unless you’ve synced with iCloud. These are just some of the very cool secret features that Apple didn’t mention during the iOS 10 release this year. As promised, I will publish an article on iMessage and all the fun and productive stuff you can do with Apple’s messaging app. If you’re reading this on Apple News, please favorite the 1RedDrop channel (next to our logo) to add us to your news feed, or Like our page on Facebook. Please bookmark our site for more insightful articles on current and future technologies that are changing our lives. Post navigation Related News Apple’s Lightning Era Nears Its End: What the USB-C Mandate Means for the Future iOS 18.2: A Revolutionary Update with Game-Changing Features Apple Launches Mac Mini with M4 Chip: A New Era of Power and Sustainability", "timestamp": 1766195750359, "lang": "en-US", "length": 6243, "meta": {"description": "Yesterday, we shared some of the top new features on the brand new iOS 10 Public Beta version 6 from Apple. The latest version of Apple’s mobile operating system family has some very cool features, but some of the best ones are the ones that Apple didn’t even mention at the WorldWide Developer Conference 2016....", "keywords": null, "published_at": 1472027768000, "canonical": "https://1reddrop.com/2016/08/24/10-hidden-features-ios-10/"}}