{"id": "f80be7239c998ad0d5a0c500fcf4106ae91b1f70", "title": "How to Block Annoying Ads on iOS 10 and iOS 9 - 1redDrop", "content": "1redDrop Technology News from the World's Most Influential Companies How to Block Annoying Ads on iOS 10 and iOS 9 Ads can be very annoying, especially when they pop up unexpectedly when you’re busy reading something important. There are several ways to block these ads and even disable in-app or inline ads that you should be aware of. I’ll also tell you why ad blockers might be considered unethical by many people, including yours truly. But first… If you weren’t already aware of this, Apple introduced content blocking on the iOS 9 last year. It’s also in the new iOS 10. You can simply go into Settings > Safari and access turn on content blocking for your iPhone or iPad’s Safari browser. In addition to these, there are also a couple of ad blockers that you can install on your iPhone or iPad running iOS 9 or higher. If you’re already on iOS 9.3.2 or have installed iOS 10 public beta version 6 ( here’s how to do that ) then you can install one of these two best ad blockers for iOS 10 and iOS 9.X Crystal Crystal is a premium ad-blocking application that you can download from the App Store. Just download the app, and then go to Settings > Safari > Content Blockers and turn on Crystal. It’s as simple as that. Once you’ve done that open up Safari and go to any web page, and you’ll see the page rendered without any advertisements. ADP AdBlock Plus This is a free app that works well on the new operating systems. Once you download and open the app itself, you should be able to see a “whitelist” where you can predefine the kind of ads that you do want to see. Most ad blockers for iPhones and iPads pretty much work the same way once they’re installed. They basically take the web page and “clean” it and then render it without ads, just for you. Of course, you’ll see lots of ads for ad blockers, which I think is hypocritical in a way. Is Ad Blocking a Good Idea? I personally don’t believe in blocking ads because they’re there for a reason. Let me give you an analogy. When you watch TV (not paid streaming videos), I mean regular TV, you might be annoyed at the number of commercials during your favorite shows, but it’s the ads that actually pay for broadcasting these programs. Now imagine if you had an ad blocker for your TV. You’d get commercial-free programming, but advertisers wouldn’t make any money. If they’re not making any money, they’re not going to support the channel that broadcasts the program. Over time, the number of advertisers will drop and the quality of programming will drop. As such, ads are what keep the content coming. The higher the quality of programming the higher the ad spend, and it’s a self-feeding cycle. More ad spend means better programming overall, and better the quality of content that you finally receive. Web content is exactly the same. If your favorite websites aren’t able to serve ads, then advertisers won’t come to them. If advertisers don’t come, your website’s owners won’t be able to afford the content they publish, and the quality of content will drop over time. Just like the TV example. So, while I think it’s okay to try and control the type of ads that you see, I personally feel that blocking all ads is counterproductive to good, solid online content. But that’s just my opinion. If you’re reading this on Apple News, please favorite the 1RedDrop channel (next to our logo) to add us to your news feed, or Like our page on Facebook. Please bookmark our site for more insightful articles on current and future technologies that are changing our lives. Post navigation Related News Apple’s Lightning Era Nears Its End: What the USB-C Mandate Means for the Future iOS 18.2: A Revolutionary Update with Game-Changing Features Apple Launches Mac Mini with M4 Chip: A New Era of Power and Sustainability", "timestamp": 1766230028458, "lang": "en-US", "length": 3780, "meta": {"description": "Ads can be very annoying, especially when they pop up unexpectedly when you’re busy reading something important. There are several ways to block these ads and even disable in-app or inline ads that you should be aware of. I’ll also tell you why ad blockers might be considered unethical by many people, including yours truly. But...", "keywords": null, "published_at": 1472114616000, "canonical": "https://1reddrop.com/2016/08/25/block-annoying-ads-ios-10-ios-9/"}}