{"id": "fc46d812133fb13cfffe4b2a5bcd4994b9b5a12a", "title": "7 Ways to Secure your iPhone from Hackers - 1redDrop", "content": "1redDrop Technology News from the World's Most Influential Companies 7 Ways to Secure your iPhone from Hackers After the debacle between Apple and the FBI, people are getting very concerned about iPhone security and mobile security in general. So what are the best ways to stop hackers from attacking your phone. If your phone is lost or stolen, that leaves you extremely vulnerable to data theft by hackers. Update – September 1, 2016 Subsequent to this article, I wrote and published another article that provides even more security tips for iPhone users. Please click on the image below to read it now. More Ways to Secure your iPhone from Hackers How do you protect your iPhone from Hackers? Apple’s own security measures are solid, but hackers are trained to break into nearly any device on the planet. Fortunately, there are ways to secure your iPhone that are nearly 100% foolproof. I say nearly because I don’t want to mislead you into thinking you can protect yourself fully. Hackers are constantly finding ways to break into new security applications and protocols. Here are the best ways to secure your iPhone and all of its data: Be on the latest iOS version at all times Software updates – especially for your operating system – are the most critical components of security. If you look into it, you’ll find that most of the recent updates that have the “dots” after the main iOS number, like iOS 9.3.2, for example, will have the latest security updates from Apple. Each time you connect your device to iTunes, it will prompt you to update your iOS version. Be sure that you have the most recent one installed. If you’re already on iOS 10 public beta, make sure you’re on version 6. Beta versions are a favorite of hackers because they may not always be fully protected. Create a Passcode that’s tough to break The longer and more complex your passcode, the harder it is for hackers to get into it. If you feel that your six-digit passcode may not be that secure (especially if you tend to use your birth date – even in reverse!), then you can change it so that you need a passphrase to enter. That would be an alphanumeric code with symbol options. Simply go into your Touch ID settings, go to Passcode -> Change Passcode and then tap on “passcode options” and select “Custom Alphanumeric Code”. It will then prompt you to set a new code, for which you can use an easy-to-remember piece of personal information that other people wouldn’t know. For example, you can still use your birth date, but make it look something like this: Jan22NineteenSeventyFive! (**Note the mix of numbers, uppercase and lowercase letters as well as the use of the symbol at the end.) It’s a little inconvenient when you want to get into your phone in a hurry, but what’s better – a couple of extra seconds spend here or several hours worrying about what happened to your data if your phone gets stolen or lost? Activate the “Find my Phone” Feature This may not seem like an obvious security measure, but if you lose your phone, it will help you locate your device (from another iOS device). The important feature here is that you can remotely wipe your data clean from your iPhone should it fall into the wrong hands. Before that, however, be sure to back up all your data to iCloud so you can retrieve it later. You won’t lose any music or data from iTunes, but everything on your phone will be wiped out, including your contacts. Back up is essential. NEVER click on unknown links or download suspicious email attachments This one should be fairly obvious, but hackers are getting so smart that they can send what look like authentic messages in an attempt to hack into your email or other data. Just deleted something if you think it looks fishy. Email and text messages are two of the most common ways for hackers to access your data. If they get into your email, they’ll get all your contacts and can even read personal emails you’ve sent or received. Don’t take a chance, just don’t click on anything that doesn’t look legit. Control Permission Settings on Apps Not all apps you download are trusted. With over 2,000,000 apps on the App Store, you just can’t take the risk. Moreover, a lot of apps get your permission to access your data, and most of us just hit “accept” without really thinking about it. To control your permission settings, go to Settings -> Privacy, and then change the privacy options on whatever apps you think may be unsafe. Unfortunately, you’ll have to do this one app at a time; there’s no option to have a standard setting for all apps. Besides, you wouldn’t want that anyway because a lot of apps do genuinely require your information to work properly. Is Siri a Spy? You might be surprised, but many hackers have used Siri to get to your personal information. Siri does ask for authentication on occasion, especially where it concerns photos and such, but there are workarounds so that even your passcode can be bypassed if you have Siri open all the time. To make sure you’re not at risk from Siri opening her mouth to unknown people, turn her off until you need to use her. If you’re in a safe place like your home, it’s okay to have her on. The convenience she provides is unparalleled. But if you’re on a night out with friends or in a public place, Siri should ideally be silenced. Do you have AutoFill on? AutoFill is very convenient, no doubt. But it can pose a major security problem because all your sensitive apps will have your username and password just sitting there begging to be hacked. AutoFill can also retrieve your credit card information for payments through Apple Pay, for example, so these are the security risks you need to be aware of. To turn off AutoFill, just go to Settings -> Safari -> AutoFill and turn off the options one at a time. Use these tips to protect yourself from digital hacking, but also be careful about where you leave your phone. It’s hard to resist showing off your new iPhone – especially since the iPhone 7 and iPhone 7 Plus are just about to launch in a matter of weeks. But it’s your security that we’re talking about, so you cannot afford to compromise on that. If you’re reading this on Apple News, please favorite the 1RedDrop channel (next to our logo) to add us to your news feed, or Like our page on Facebook. Please bookmark our site for more insightful articles on current and future technologies that are changing our lives. Post navigation Related News Apple’s Lightning Era Nears Its End: What the USB-C Mandate Means for the Future iOS 18.2: A Revolutionary Update with Game-Changing Features Apple Launches Mac Mini with M4 Chip: A New Era of Power and Sustainability", "timestamp": 1766237743896, "lang": "en-US", "length": 6658, "meta": {"description": "After the debacle between Apple and the FBI, people are getting very concerned about iPhone security and mobile security in general. So what are the best ways to stop hackers from attacking your phone. If your phone is lost or stolen, that leaves you extremely vulnerable to data theft by hackers. Update – September 1, 2016...", "keywords": null, "published_at": 1472113018000, "canonical": "https://1reddrop.com/2016/08/25/secure-iphone-hackers/"}}